Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །ཕྱི་དང་ནང་གི་ཆོས་གང་ཡིན་པ་དེ་དག་གི་ཡོངས་སུ་གྲུབ་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཅེས་བྱ་སྟེ། འདི་ལྟ་སྟེ། གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དང་། སྒྲའི་དེ་བཞིན་ཉིད་དང་། དྲིའི་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ལ་སོགས་པ་ལྟ་བུའོ།
en: The thoroughly established nature of any outer or inner dharma is “the suchness of all dharmas,” for example the suchness of a shape, the suchness of a sound, the suchness of a smell, and so on.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་གནས་གྱུར་པ་ཆོས་ཀྱི་སྐུ་ནི་གཉིས་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་དེ་བཞིན་ཉིད་ཅེས་བྱ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་གཞི་ཡིན་པའི་ཕྱིར་རོ།
en: The dharma body of all buddhas, the transformed tathāgata­garbha, is the second “suchness of the dharma-constituent” because it is the basis of all the buddhadharmas.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པ་ནི་ཡང་དག་པའི་མཐའི་དེ་བཞིན་ཉིད་ཅེས་བྱ་སྟེ།
en: The śrāvaka and pratyekabuddha nirvāṇa without remaining aggregates is “the suchness that is the very limit of reality.”

source: འདིས་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མི་བྱའོ་ཞེས་བྱ་བ་དང་། འཁོར་བ་ཡང་མི་ལེན་ཏོ་ཞེས་བྱ་བ་དང་། ཡང་དག་པའི་མཐའ་ཡང་མངོན་སུམ་དུ་མི་བྱེད་དོ་ཞེས་དེ་དང་དེ་དག་ལས་བཤད་པ་གང་ཡིན་པའོ།
en: That is what is being talked about where it says “ ‘I should not actualize the very limit of reality,’ ” “or ‘do not appropriate’ a life in saṃsāra,” and “but still do not actualize the very limit of reality.”

source: །ཡང་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཅེས་པ་སྔ་མ་ནི་ས་བརྒྱད་པ་ལ་ལྷུན་གྱིས་གྲུབ་པར་རྣམ་པར་མི་རྟོག་པས་རྟོག་པ་བསྟན་པའི་ཕྱིར་གསུངས་སོ།
en: Furthermore, it speaks about the earlier “suchness of all dharmas” to teach that it is comprehended at the eighth level as effortlessly without conceptualization.

source: །འདིར་ནི་མཐར་ཕྱིན་པའི་ས་བསྟན་པའི་ཕྱིར་གསུངས་པར་རིག་པར་བྱའོ།
en: As for this, it should be understood as being spoken about to teach the level when the end has been reached. “

source: །སའི་རྡུལ་ཕྲ་རབ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཤེས་པར་འདོད་པ་ཞེས་བྱ་བ་ནི་ས་བཅུ་པ་ལས་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་ལ་མཁྱེན་པ་འཇུག་པ་ལ་སོགས་པ་ཡོན་ཏན་ཁྱད་པར་ཅན་རྣམས་བསྟན་པའོ།
en: Want to know how many tiny particles of earth there are” teaches, according to The Ten Bhūmis, the special qualities of the operation of knowledge on the tiny particles and so on. “

source: །སོར་མོ་གཅིག་གི་རྩེ་མོས་གཞིལ་བར་བྱ་བར་འདོད་པས་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་རྩིག་པ་ལ་སོགས་པས་རླུང་བཅིལ་བ་དེ་བཞིན་དུ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཁྱབ་པར་འཇིག་པའི་རླུང་ཡང་སོར་མོའི་རྩེ་མོ་གཅིག་གིས་རྩིག་པ་ལ་སོགས་པ་བཞིན་དུ་འཇིལ་བར་བྱེད་པའོ།
en: Want to blunt with the tip of one finger”— just like walls and so on that have blunted the force of the wind, the single tip of a finger blunts the shaking wind that pervades all world regions as does a wall and so on. “

source: །སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་རྒྱས་པར་དགང་བར་འདོད་པས་ཞེས་བྱ་བ་ནི་བདག་གི་སྟན་གྱིས་ཁེབས་པར་འདོད་ན་ནམ་མཁའ་རྒྱས་པར་འགེངས་པའོ།
en: Want their single cross-legged posture to expand into and fill up…”— they want their posture to cover space, expanding into it and filling it up. “

source: །བསོད་སྙོམས་གཅིག་གིས་ཞེས་བྱ་བ་ནི་དུས་གཅིག་ཏུ་ཟས་ཀྱིས་ཏེ། དུས་མཐུན་པར་ཟས་ཀྱིས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: With a single alms bowl” means with what they eat at one time, with what they eat at the proper time. “

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་ཇི་ལྟ་བུས་བཙལ་ན་ཞེས་བྱ་བ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཅིག་པུས་ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅེས་བྱའོ།
en: How, Lord… when bodhisattva great beings are giving a gift?” “How do they complete the six perfections with the perfection of giving alone?” “

source: །རྣམ་པར་གཡེང་བ་དང་ཀུན་ཏུ་རྟོག་པ་མེད་པའི་ཕྱིར་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་གང་གི་ཕྱིར་སྦྱིན་པ་གཏོང་བ་ན་རྣམ་པར་མི་གཡེང་ལ་དེ་ལ་ཀུན་ཏུ་རྟོག་པ་ཡང་མེད་ལ་དེའི་ཕྱིར་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: The perfection of concentration… because of not being distracted and not constructing any ideas”— because they are not distracted when they give a gift and then do not construct any idea about it they therefore complete the perfection of concentration. “

source: །ཆོས་ཐམས་ཅད་རབ་ཏུ་ཤེས་པ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཤེས་རབ་ཀྱིས་ཤེས་སོ་ཞེས་བྱ་བར་མི་དམིགས་པའོ།
en: The perfection of wisdom… by way of not apprehending the knowledge of all dharmas” is saying that they know all phenomena with wisdom so they do not apprehend. “

source: །ཤའི་མིག་དང་ལྷའི་མིག་ཅེས་བྱ་བ་ལ་སོགས་པ་ལ། གཟུགས་ཀྱི་སྐུའི་སྤྱན་ནི་ཤའི་མིག་གོ། །ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་།
en: The flesh eye, divine eye,” and so on—the flesh eye is the form body eye.

source: མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཐམས་ཅད་ནི་ལྷའི་མིག་གོ།
en: The divine eye knows all meditative stabilizations, absorptions, and clairvoyances.

source: །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ནི་ཤེས་རབ་ཀྱི་མིག་གོ།
en: The wisdom eye knows the knowledge of a knower of all.

source: །ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་མཁྱེན་པ་དང་། དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་དང་། མོས་པ་སྣ་ཚོགས་དང་ཁམས་སྣ་ཚོགས་མཁྱེན་པ་ནི་ཆོས་ཀྱི་མིག་གོ།
en: The Dharma eye knows the path wherever it goes, higher and lower faculties, various dispositions, and various constituents.

source: །རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱིས་བསྡུས་པ་དགྲ་བཅོམ་པའི་ལམ་གྱི་ཡེ་ཤེས་ནི་སངས་རྒྱས་ཀྱི་མིག་གོ།
en: The knowledge of a worthy one’s path included in the vajropama meditative stabilization is the buddha eye. “

source: །ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་ཆོས་སྟོན་པ་དེ་དག་ཐམས་ཅད་ཐོས་ནས་དྲན་པའི་སྟོབས་བསྐྱེད་པས་གཅད་དུ་མི་ཆོད་པས་ཡང་དག་པར་གཟུང་བར་འདོད་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ཐམས་ཅད་ཆུད་མི་ཟ་བར་བྱ་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བ་ནི་གཞུང་ལས་འབྱུང་བར་ཟད་དོ།
en: Moreover, Śāriputra, bodhisattva great beings who want to hear the entire doctrine that the lord buddhas in all world systems in all ten directions explain, and having heard it take it up perfectly by applying the power of memory uninterruptedly, and who do not want any to be lost up until they awaken to unsurpassed, perfect, complete awakening should train in the perfection of wisdom.” This passage is self-explanatory. “

source: །མུན་པ་མུན་ནག་ཏུ་གྱུར་པ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་བར་དག་ནི་མུན་པའོ།
en: Blinding darkness”— the regions between worlds are “blinding.”

source: །དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ལམ་ལ་བསླབ་པར་འདོད་པ་ཞེས་བྱ་བ་ནི་སྐུའི་གསང་བ་ས་བཅུ་ཐོབ་པའི་སྤྱོད་ཡུལ་ཡིན་པས་དེ་སྐད་བཤད་དོ།
en: They want the greatnesses of buddhas “Want to train in the tathāgatas’ way of carrying themselves”— it says this because the secrets of the body are within the range of those who have attained the tenth level. “

source: །གླང་པོ་ཆེའི་ལྟ་སྟངས་ཞེས་བྱ་བ་ནི་དམ་པ་རྣམས་ཀྱི་ལྟ་སྟངས་ཏེ་དེ་དག་ནི་སྟེང་ན་འདུག་པ་ལ་བསྐྱེད་དེ་མི་ལྟ།
en: Look down as an elephant looks”— this is the gaze of holy beings.

source: འོག་ནས་འདུག་པ་ལ་བཏུད་དེ་མི་ལྟ། གཡས་གཡོན་ན་འདུག་པ་ལ་ནི་མིག་བཟུར་ཏེ་མི་ལྟ། རྒྱབ་ན་འདུག་པ་ལ་ནི་མཇིང་པ་བསྒྱུར་ཏེ་མི་ལྟ། ཐག་རིང་པོ་ནི་འདུག་པ་ལ་བསྒྲིམས་ཏེ་མི་ལྟ། ཐག་ཉེ་བ་ན་འདུག་པ་ལ་བསྒྲིམས་པ་མེད་པར་ཡང་མི་ལྟའི།
en: They do not look up at what is above, look down at what is below, look to the sides at what is to the right or left, twist their neck to look at what is behind, concentrate to look at what is far off, or look without concentrating at what is close by.

source: ཇི་ལྟར་འདུག་པའི་སྤྱོད་ལམ་དང་། ཇི་ལྟར་ལྟ་བའི་མིག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་དང་། ཆོས་ཐམས་ཅད་ལ་ལྟ་བ་ནི་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཞེས་འཆད་དོ།
en: This says that however they are carrying themselves and however they are looking, they “look down as an elephant looks” because they look at all beings and all dharmas in all world systems.

source: །འགྲོ་བ་དང་འགྲེང་བ་དང་འདུག་པ་ཞེས་བྱ་བ་ལ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་ནི་སྤྱོད་ལམ་རྣམ་པ་གསུམ་གྱིས་བཞུགས་སོ། །ཉལ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་སྟེ།
en: It is said that “walk, stand, sit” are the three ways they carry themselves when at the site of awakening; and “lie down” is when they pass into the great complete nirvāṇa.

source: དུས་དེ་གཉིས་ཀ་ཡངས་ཐ་མལ་པས་ལྡེག་མི་ནུས་སོ་ཞེས་འཆད་དོ།
en: At both those times the ordinary earth cannot shake.

source: །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱིས་བཅགས་པའི་ས་གཞི་ཐམས་ཅད་རྡོ་རྗེ་ལྟ་བུར་གྱུར་ན་ཅི་ཉེས་ཤེ་ན།
en: What would the fault be if all the earth on which the Tathāgata trod were to have “become all diamond?”

source: འདོད་པའི་ཡོན་ཏན་ལྔ་འབྱུང་བར་མི་འགྱུར་བའི་ཕྱིར་རོ།
en: It is because the five sorts of sense objects would not come about: “in order to brings beings to maturity… taking to the five sorts of sense objects.”

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འདོད་པའི་ཡོན་ཏན་ལྔ་ཉེ་བར་འཛིན་ཞེས་བྱ་བ་ནི་ས་བརྒྱད་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགྲ་བཅོམ་པ་དང་འདྲ་བར་ཉོན་མོངས་པ་དང་ཤིན་ཏུ་བྲལ་ཏེ་དེ་དག་ལ་ཉོན་མོངས་པ་ཀུན་ཏུ་འབྱུང་བ་ཤིན་ཏུ་ཕྲ་མོ་ཡང་མེད་པས་ན་འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་ཡོངས་སུ་སྤྱོད་མི་སྲིད་མོད་ཀྱི།
en: It is true that bodhisattvas on the eighth level, like worthy ones, are totally “without afflictions,” and hence without even the faintest habituation to afflictive emotion, so they could never “make use of” the five sorts of sense objects.

source: འོན་ཀྱང་བདག་ཅག་གི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བསྡུ་བའི་དངོས་པོ་ལ་མཁས་པ་སྟེ། དོན་མཐུན་པས་སེམས་ཅན་རྣམས་བསྡུ་བའི་ཕྱིར་བུད་མེད་ཉི་ཁྲི་བཞི་སྟོང་རེ་རེ་ལ་ཡང་བདག་གི་ལུས་ཀྱང་དེ་སྙེད་དུ་སྤྲུལ་ཏེ། དེ་དག་ཐམས་ཅད་དགའ་བར་མཛད་དོ།
en: Nevertheless, our Bodhisattva, “skilled” in the ways of gathering a retinue, in order to gather beings through the consistency between his words and deeds magically produces duplicates of himself for each of twenty-four thousand women and thrills them all.

source: །དེ་བས་ན་ས་འཚོ་མ་ལ་སོགས་པ་བུད་མེད་ཉི་ཁྲི་བཞི་སྟོང་དང་། གར་མཁན་མོ་དགུ་སྟོང་དང་། དེ་དག་གི་གཡོག་འཁོར་མང་པོ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་བསྟན་པ་རྣམས་དང་། ལྷ་དང་། ཚངས་པ་རྣམས་ཀྱི་ནང་ན་ཐེག་པ་གསུམ་གྱིས་ཡོངས་སུ་སྨིན་པར་མ་མཛད་པ་གང་ཡང་མེད་དོ།
en: Hence, he made a show of Yaśodharā and the other twenty-four thousand women and the nine thousand dancers together with their many attendants, and he made a show of old age, sickness, and death—there is nothing he did not do among the gods and Brahmās, bringing them to maturity in the three vehicles.

source: །དེ་བས་ན་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ཉིད་ཀྱི་ཕྱིར་འདོད་པ་ལ་སྤྱོད་པ་བསྟན་ཏོ།
en: Therefore, he made a show of using sense objects in order to bring beings to maturity.

source: །ཇི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་འདོད་པ་དག་གི་སྐྱོན་རྣམས་མཐའ་ཡས་པ། །འཆི་དང་ཁོན་བཅས་སྡུག་བསྔལ་ཅན་ཏེ་མྱ་ངན་རྩ། །འཇིག་པར་བྱེད་ཅིང་དུག་དང་འཁྲུལ་འཁོར་འདྲ་བ་དང་། །མེ་འབར་འདྲ་ཞིང་རལ་གྲིའི་སོ་འདྲར་ཤེས་པས་ན།
en: Thus, it says, “Then the Bodhisattva had this thought: “ ‘I know that without end are the faults of sense objects, the roots of suffering with their death, enmity, and pain, Scary, like poison, like a mesmerizing diagram, like fire, like the blades of swords.

source: །འདོད་པའི་ཡོན་ཏན་དག་ལ་བདག་འདུན་འདོད་ཆགས་མེད།
en: I have no yearning desire For the different sorts of sense objects.

source: །བུད་མེད་ཁྱིམ་ན་གནས་པ་བདག་ལ་མི་མཛེས་ཀྱིས།
en: I do not deck myself out for life in the women’s quarters.

source: །བདག་ནི་ནགས་ཀྱི་འདབ་ཏུ་སོང་སྟེ་མི་སྨྲ་བར། །བསམ་གཏན་ཏིང་འཛིན་སྒོ་ནས་སེམས་ཞི་གནས་པར་བྱ། །ཞེས་གསུངས་པ་ལྟ་བུའོ།
en: Rather, I would live quietly in the forest at peace in my mind with the happiness of the concentrations and meditative stabilizations.’ “

source: །དེས་ཡང་དེ་ལྟར་བརྟགས་ནས་ཐབས་མཁས་པས་མངོན་སུམ་དུ་མཛད་དེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་ཕྱིར་ཐུགས་རྗེ་ཆེན་པོ་བསྐྱེད་ནས། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་གསུངས་སོ། །ཀུ་མུ་ད་ནི་འདམ་རྫབ་ནང་ན་སྐྱེ། །མི་ཡིས་གང་བའི་ནང་ནས་རྒྱལ་པོས་མཆོད་པ་ཐོབ།
en: But still, having made an analysis and realized the skillful means, looking to bring beings to maturity he felt great compassion and at that time pronounced this verse: “ ‘The lotus grows in the swamp; the king crowded around by men gets honor.

source: །གང་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གཡོག་འཁོར་མང་བརྙེས་པ། །དེ་ཚེ་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བདུད་རྩིས་འདུལ།
en: When bodhisattvas acquire a mighty retinue They tame one hundred million billion beings with divine nectar.

source: །བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་གང་དག་སྔོན་བྱུང་བ། །ཀུན་གྱིས་སྲས་དང་བཙུན་མོ་བུད་མེད་བསྟེན་གྱུར་ཀྱང་། །འདོད་པས་ཆགས་མེད་བསམ་གཏན་བདེ་ལས་ཉམས་མ་གྱུར། །དེ་བས་དེ་དག་ཡོན་ཏན་རྗེས་སུ་བདག་གིས་བསླབ།
en: All earlier bodhisattvas with skillful means Made a show of wives, offspring, and women; unattached to sense objects, they did not destroy The ease of concentration, so I too will follow them in learning those qualities.’ ”

source: །ཅེས་བྱ་བ་ལ་སོགས་པའོ། །གལ་ཏེ་འདོད་པ་ལ་སྤྱོད་པ་བདེན་པ་མ་ཡིན་ན་སྒྲ་གཅན་ཟིན་སྲས་ཡིན་ནོ་ཞེས་བྱ་བ་ཡང་{བརྫུན་,རྫུན་}པར་འགྱུར་རོ་ཞེ་ན་ཡང་{བརྫུན་,རྫུན་}མ་ཡིན་ཏེ།
en: Qualm: If his enjoyment of sexual pleasure is not true, then it is a lie to say Rāhula is his son.

source: བུ་ཞེས་བྱ་བ་ནི་འདོད་པ་ལ་ཡོངས་སུ་སྤྱོད་པའི་རྒྱུས་མངལ་ནས་སྐྱེས་པ་འབའ་ཞིག་ལ་བྱ་བ་མ་ཡིན་གྱི།
en: It is not a lie, because “son” is said not only of someone born from a womb on account of the enjoyment of sexual pleasure.

source: བརྫུས་ཏེ་སྐྱེ་བ་དེ་དག་ཀྱང་ཡོད་དོ།
en: There are also those born miraculously.

source: །སྒྲ་གཅན་ཟིན་བཟང་པོ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡིན་ཏེ། དགོས་པའི་དབང་གིས་མངལ་ན་གནས་པའི་ཚུལ་བསྟན་ཏོ།
en: Holy Rāhula, furthermore, was a bodhisattva great being who made a show of gestating in the womb because there was a purpose in doing so.

source: །སེམས་བསྐྱེད་པའི་ལེའུ་སྟེ་གཉིས་པའོ།
en: The second chapter, Production of the Thought.

source: །སེམས་ཞེས་བྱ་བ་ནི་འདིར་མངོན་པར་འདོད་པ་ལ་བྱ་སྟེ།
en: The “thought” here should be taken as wanting.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་འདོད་པ་སྐྱེས་པ་བསྟན་པ་ལ་སེམས་བསྐྱེད་པའི་ལེའུ་ཞེས་བྱའོ།། །།བམ་པོ་དྲུག་པ།
en: It says “Production of the Thought chapter” to teach that wanting has arisen for all the qualities of a bodhisattva and all the qualities of a buddha.

source: དེ་ལྟར་གང་གི་ཕྱིར་བརྩོན་པར་བྱ་བ་ཞེས་བྱ་བ་ལ། འདིར་བསླབ་པའི་བརྩོན་པར་བྱ་བ་བསྟན་ནས། ད་ནི་ཇི་ལྟར་བརྩོན་པར་བྱ་ཞེས་བྱ་བ་ལ་ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔར་གྱུར་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: How bodhisattvas endeavor Having thus taught, in response to “why bodhisattvas endeavor,” that they have to endeavor to train in this now, in response to “how bodhisattvas endeavor,” in the passage, Venerable Śāriputra having thus inquired, the Lord said to him, “Śāriputra, here bodhisattva great beings practicing the perfection of wisdom do not, even while they are bodhisattvas, see a bodhisattva.

source: །བྱང་ཆུབ་སེམས་དཔའ་མིང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not see even the word bodhisattva.

source: །བྱང་ཆུབ་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not see awakening either, and they do not see the perfection of wisdom.

source: །སྤྱོད་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །མི་སྤྱོད་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not see that ‘they practice,’ and they do not see that ‘they do not practice.’

source: །སྤྱོད་ཀྱང་སྤྱོད་ལ་མི་སྤྱོད་ཀྱང་མི་སྤྱོད་དོ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །སྤྱོད་པ་ཡང་མ་ཡིན་མི་སྤྱོད་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བར་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They also do not see that ‘while practicing they practice and while not practicing do not practice,’ and they also do not see that ‘they do not practice, and do not not practice as well.’

source: །གཟུགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not see form.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པའི་གཞུང་གིས་འདིར་སྤྱད་པའི་བརྩོན་པར་བྱ་བ་སྟོན་ཏོ།
en: Similarly, they do not see feeling, perception, volitional factors, or consciousness either,” and so on, it teaches that they have to endeavor at practicing this.

source: །ཤཱ་རིའི་བུས་བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བགྱི་ཞེས་ཞུས་པ་ནི་ཆོས་རྣམ་པ་གསུམ་དམིགས་པ་དང་བཅས་པ་དང་། མཚན་མ་དང་བཅས་པའི་ཚུལ་གྱིས་ཞུས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དང་།
en: Śāriputra’s question, “Lord, how then should bodhisattva great beings practice the perfection of wisdom?”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: about the threefold dharma—the bodhisattva, the perfection of wisdom, and the practice of it—is posed in a mode together with apprehending and with causal signs.

source: དེ་ལ་སྤྱོད་པའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དམིགས་པ་དེ་དག་བསལ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས་པ་རྣམ་པ་གསུམ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མི་དམིགས་པ་དང་། སྤྱོད་པ་མི་དམིགས་པ་རྣམ་པ་བཞི་བསྟན་པས་མི་དམིགས་པ་སྟོང་པ་ཉིད་གསུངས་སོ།
en: Then, to eliminate those ways of apprehending, the Lord, by teaching three ways of not apprehending a bodhisattva, not apprehending the perfection of wisdom, and four ways of not apprehending practice speaks about the emptiness of not apprehending.

source: །བྱང་ཆུབ་སེམས་དཔའི་མི་དམིགས་པ་གསུམ་ནི་སེམས་དཔའ་མི་དམིགས་པ་དང་མིང་མི་དམིགས་པ་དང་། བྱང་ཆུབ་མི་དམིགས་པའོ།
en: The three absences of apprehending of a bodhisattva are not apprehending a bodhisattva, not apprehending a name, and not apprehending awakening.

source: །བྱང་ཆུབ་སེམས་དཔར་གྱུར་བཞིན་དུ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་ཡོད་པའི་ཕྱིར་ཏེ། འདིས་ནི་སྐུར་པ་འདེབས་པའི་མཐའ་སྤངས་སོ།
en: As for “even while they are bodhisattvas,” this is to stop the extreme of over-negation because there are true-dharmic-nature bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞེས་བྱ་བ་ནི་སེམས་དཔའ་མི་དམིགས་པའི་ཕྱིར་རོ།
en: They “do not… see a bodhisattva” because of not apprehending a bodhisattva. “

source: །མིང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་བདག་ཉིད་ཀྱིས་སོ།
en: They do not see even the word” that is falsely imagined in nature. “

source: །བྱང་ཆུབ་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བར་ནི་གནས་གྱུར་པ་མ་གཏོགས་པར་བྱང་ཆུབ་ཅེས་བྱ་བའི་མིང་གི་ཆོས་མེད་པའི་ཕྱིར་རོ།
en: They do not see awakening either,” because, apart from the transformation of the basis, a phenomenon with the name awakening does not exist. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་དག་པ་མ་གཏོགས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་ཆོས་མེད་པའི་ཕྱིར་རོ།
en: And they do not see the perfection of wisdom,” because, apart from the pure dharma-constituent, a perfection of wisdom dharma does not exist. “

source: །སྤྱོད་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ལ་བྱ་བ་མེད་པའི་ཕྱིར་རོ།
en: They also do not see that ‘they practice’ ” because there is nothing to be done for all the qualities. “

source: །མི་སྤྱོད་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ནི་བྱེད་པ་མེད་དུ་ཟིན་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སྦྱང་བར་བྱ་བར་ཡོད་པའི་ཕྱིར་རོ།
en: And they do not see that ‘they do not practice,’ ” because even though action has been taken as nonexistent, there is a purification of the dharma-constituent. “

source: །སྤྱོད་ཀྱང་སྤྱོད་ལ་མི་སྤྱོད་ཀྱང་མི་སྤྱོད་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ནི་གཉིས་ཀ་གཅིག་ཏུ་བསྡུས་ནས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ། སྐྱོན་གཉིས་པོ་དེ་ཉིད་དུ་འགྱུར་བའི་ཕྱིར་རོ།
en: They also do not see that ‘while practicing they practice and while not practicing they do not practice,’ ” that is, they do not, having combined them into one, see both, because those exact same two faults occur. “

source: །སྤྱོད་པ་ཡང་མ་ཡིན་མི་སྤྱོད་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ནི་དེ་ལྟར་གཉིས་སུ་མེད་པར་བརྗོད་མོད་ཀྱི་འོན་ཀྱང་གཉིས་སུ་མེད་པའི་རྣམ་པ་དེ་ནི་རྣམ་པ་མེད་པའི་ཕྱིར་དེ་ལྟར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: And they also do not see that ‘they do not practice, and do not not practice as well,’ ” because, even though the nonexistence as the two like that has been stated, that mental image of the nonexistence as the two is a mental image that does not exist, so they do not see it.

source: །དེ་ལྟར་སྔར་གང་ཟག་སྟོང་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མེད་པར་བསྟན་ནས། ད་ནི་ཆོས་བདག་མེད་པས་གཟུགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དང་།
en: Having thus earlier taught that a bodhisattva does not exist on account of the emptiness of a person, now on account of the emptiness of the dharmas it teaches, “They do not see form.

source: ཚོར་བ་ལ་སོགས་པ་ལ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་བསྟན་ཏོ།
en: Similarly, they do not see feeling,” and so on.

source: །དེ་བས་ན་ཕུང་པོ་ལྔའི་རྣམ་པ་ཡང་མེད་དོ།
en: Therefore one does not exist in the form of the five aggregates either.

source: །སྤྱོད་པའི་རྣམ་པར་རྟོག་པ་དེ་ལྟར་དམིགས་སུ་མེད་པར་བསྟན་ནས་དེ་ཅིའི་ཕྱིར་ཞེ་ན་ཞེས་བྱ་བས་གཏན་ཚིགས་སྟོན་ཏོ།
en: Having taught that such options for practice cannot be apprehended, with “and why?” it teaches the reason why.

source: །བྱང་ཆུབ་སེམས་དཔའི་མིང་ལ་སོགས་པ་དམིགས་སུ་མེད་པ་དང་། དེའི་སྟོང་པ་ཉིད་དམིགས་སུ་ཡོད་པ་བསྟན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་མིང་དེ་ནི་མིང་གི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་གི།
en: In order to teach that “the name bodhisattva” and so on cannot be apprehended, and the “emptiness” of that can be apprehended, it says “the name bodhisattva is empty of the intrinsic nature of a name.

source: སྟོང་པ་ཉིད་ཀྱིས་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: The name bodhisattva is not empty because of emptiness,” and so on.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་མིང་ནི་ཀུན་བརྟགས་པ་སྟེ། དེ་ཀུན་བརྟགས་པའི་ངོ་བོ་ཉིད་ཀྱིས་ནི་མེད་ཀྱི། དེས་ན་མེད་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཡོད་དོ།
en: Thus, the name bodhisattva is falsely imagined and they do not exist with that falsely imagined intrinsic nature, but that which is the emptiness that is the nonexistence, that does exist.

source: །དེ་བས་ན་སྟོང་པ་ཉིད་དེས་ནི་སྟོང་པ་ཉིད་མ་ཡིན་ནོ་ཞེས་བྱ་བ་སྟེ།
en: Therefore, that “name bodhisattva is not empty because of emptiness.”

source: འདིས་ནི་སྒྲོ་འདོགས་པ་དང་སྐུར་བ་འདེབས་པའི་མཐའ་སྤངས་སོ།
en: This avoids the extremes of over-reification and over-negation.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་མིང་ཡང་མིང་གི་ངོ་བོ་ཉིད་ཀྱིས་ཡོད་པ་མ་ཡིན་ནོ།
en: Hence, it teaches that the name bodhisattva does not exist on account of the intrinsic nature of the name. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཀུན་བརྟགས་པའི་ཆོས་ཀྱི་རྣམ་པར་ནི་མེད་ཀྱི།
en: The perfection of wisdom, too,” does not exist in the form of a falsely imagined dharma.

source: ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་དག་པའི་རྣམ་པར་ནི་ཡོད་དོ།
en: It does exist in the form of the pure dharma-constituent.

source: །ཕུང་པོ་རྣམས་ཀྱང་ཕུང་པོའི་ངོ་བོ་ཉིད་དུ་ནི་མེད་ཀྱི། ཕུང་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་ནི་ཡོད་དོ་ཞེས་བསྟན་ཏོ།
en: The aggregates also do not exist on account of the intrinsic nature of the aggregates, but they do exist on account of the intrinsic nature that is the nonexistence of the aggregates.

source: །འདི་ལ་ཡང་ཐེ་ཚོམ་ཡོད་དོ་སྙམ་པ་ལ་དེ་ཅིའི་ཕྱིར་ཞེ་ན་ཞེས་བྱ་བས་གཏན་ཚིགས་བསྟན་ཏོ།
en: Someone might still doubt this, so it says, “And why?” and teaches the reason.

source: །ཐེ་ཚོམ་ཡང་གང་ཞེ་ན།
en: What is the doubt?

source: གལ་ཏེ་ཆོས་ཐམས་ཅད་དེ་དག་ཆོས་ཀྱི་ངོ་བོ་ཉིད་དུ་མེད་ལ། སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དུ་ནི་ཡོད་ན། དེ་ལྟ་ན་ནི་ཆོས་རྣམས་ཡོད་དོ་ཞེས་བྱ་བ་ཉིད་དུ་འགྱུར། གང་ཆོས་རྣམས་ཡོད་དོ་ཞེས་བྱ་བ་དེ་ཉིད་ཀྱིས་ཆོག་པས་སྟོང་པ་ཉིད་དམ་གཞན་གྱིས་ཀྱང་རུང་སྟེ་ཞེས་བྱ་བ་དེས་ཅི་ཞིག་བྱ་སྙམ་པ་ལ།
en: It is that if all those dharmas do not exist on account of the intrinsic nature of the dharmas, but do exist on account of the intrinsic nature of the emptinesses, then “the dharmas exist” would become a fact, and since just those that are “the dharmas that exist” would be sufficient, what is the use of saying they are emptinesses or anything else?

source: བྱང་ཆུབ་སེམས་དཔའི་མིང་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་མིང་མ་ཡིན་ནོ་ཞེས་བྱ་བ་གསུངས་ཏེ། ཇི་སྐད་དུ་བསྟན་པ་ཡིན་ཞེ་ན།
en: It says, “Because the emptiness of the name bodhisattva is not the name bodhisattva…” What does this teach?

source: བྱང་ཆུབ་སེམས་དཔའི་མིང་ཡང་གཞན་ལ་སྟོང་པ་ཉིད་ཀྱང་གཞན་ཡིན་ཏེ། དེ་བས་ན་སྟོང་པ་ཉིད་ཡོད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་མིང་ཡང་ཡོད་དོ་ཞེས་བརྗོད་པར་མི་ནུས་སོ།
en: You cannot say, “The name bodhisattva is one thing and emptiness is another, so, because emptiness exists, therefore the name bodhisattva exists as well.”
